artillery.yaml
config:
  target: "http:/"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Inicialização (Warm up) da aplicação
    - duration: 360
      arrivalRate: 20
      name: Adicionando mais carga
    - duration: 360
      arrivalRate: 30
      name: Adicionando mais carga
    - duration: 120
      arrivalRate: 10
      rampTo: 5
      name: Finalização
scenarios:
  - flow:
      - post:
          url: "/clientes.jailtonjunior.site/api/v1/customers"
          json:
            document: "43040606867"
            name: "Antony Lima Teixeira"
            birthDay: "2020-12-19T17:30:00.000Z"
      - post:
          url: "/emprestimos.jailtonjunior.site/api/v1/loans"
          json:
            document: "43040606867"
            income: 1000
            value: 23000
            quantity: 15
            rate: 2.5